# DBeam_SetBeamAngle2

```pascal
PROCEDURE DBeam_SetBeamAngle2(angle : REAL);
```

```python
def vs.DBeam_SetBeamAngle2(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight